{
	"projects": [
		{
			"name": "NSS Cohort 20 Site",
			"site_url": "http://nashss.com/cohort20",
			"github_url": "https://github.com/nss-day-cohort-20/Cohort20Site",
			"screenshot_url": "images/screenshots/c20-site.png",
			"description":
				"This is the website for our Nashville Software School cohort. It was built using Bootstrap 4, Grunt, and Handlebars.  I was team lead on the project."
		},
		{
			"name": "SpinTracker",
			"site_url": null,
			"github_url": "https://github.com/thejonroberts/SpinTracker-Capstone",
			"screenshot_url": "images/screenshots/SpinTracker.png",
			"description":
				"This is a news aggregation app focused on tracking narratives accross outlets with different biases/perspectives. It is built in AngularJS and Bootstrap, using data stored in Firebase. The build process also included Grunt for the Sass styling. It utilizes a simple Node webscraper, using request and cheerio to save article information from RSS feeds to the Firebase database. SpinTracker was my capstone project for the front-end portion on the Full Stack Web Development course."
		},
		{
			"name": "BuddyStream",
			"site_url": null,
			"github_url": "https://github.com/thejonroberts/BuddyStream",
			"screenshot_url": "images/screenshots/BuddyStream.png",
			"description":
				"A chat app to watch streams together. The app uses WebRTC protocols to set up a peer-to-peer webcam chat. Both local and remote video streams can then be processed/filtered by javascript and rendered on a canvas overlay (in the style of Mystery Science Theater 3000). The backend is a Node server using Sequelize to interact with PostgreSQL data and serves it up via express. The express server is also handling the signaling for the WebRTC protocols via a web socket connection."
		},
		{
			"name": "SnapShop",
			"site_url": null,
			"github_url": "https://github.com/DillGromble/wicTN",
			"screenshot_url": "images/screenshots/SnapShop.png",
			"description":
				"A mobile first app for finding places that accept WIC, SNAP and EBT in the state of Tennessee. The app is built in React, and adds user generated info on payments to Google Maps API info, which is then stored in Firebase."
		}
	]
}
